# задание 1
x = input()
y = input()
z = input()
print(x + ' ' + y + ' ' + z)
# # Програмирование (ввод в консоль)
# # после
# # школы!
# # Програмирование после школы!

# задание 2
a = int(input())
b = int(input())
print(2**8*a**8 - 2**4*a**4 + 2**2*a**2 - 2*b + 0.5*b**0.5 + ((a*b)**(a+b))/2)
# 2 (ввод в консоль)
# 9 (ввод в консоль)
# 32134205104895.5 (вывод в консоли)

# задание 3
a = input()
b = input()
print(a + b, end='!')
# ввод 2 и 3 вывод 23!

# задание 4
a = int(input())
b = int(input())
c = int(input())
print('(', end= '')
print(a, b, sep= '+', end='-')
print(c, ') % 10', sep= '', end= '=')
print((a + b + c) % 10)
# ввод в консоль:  a = 123, b = 456, c = 789
# вывод в консоли: (123+456-789) % 10=8

# задание 5
a = int(input())
print(a + 1, a -1, sep='')
# ввод к консоль: 24, вывод в консоли 2523

# задание 6
a = int(input())
print(a // 100000)
# ввод в консоль: 123456789, вывод в консоль: 1234